"PayNow" = "Start payment process";

"PaymentProductsErrorExplanation" = "We are unable to retrieve the available payment products. \n\n Please check your internet connection and the provided client session identifier and customer identifier.";

"PaymentProductErrorExplanation" = "We are unable to retrieve information about the selected payment product. \n\n Please check your internet connection and the provided client session identifier and customer identifier.";

"SubmitErrorExplanation" = "We are unable to retrieve a key to encrypt your payment information. \n\n Please check your internet connection and the provided customer client session identifier and customer identifier.";

"ConnectionErrorTitle" = "Connection error";

"RememberMyDetails" = "Remember my payment details for future purchases";

"AvailablePaymentProducts" = "Select a payment product";

"PreviousPaymentProducts" = "Previously used payment products";

"Pay" = "Pay";

"Cancel" = "Cancel";

"AmountHeaderDescription" = "Order total";

"SecurePayment" = "Secure payment";

"ContinueButtonTitle" = "Start another payment process";

"SuccessLabel" = "Congratulations!";

"SuccessText" = "Your payment has been successfully processed by the SDK.\n\nThe method \"didSubmitPaymentRequest\" in \"GCStartViewController\" contains the encrypted data that should be sent to GlobalCollect.";

"SetupExplanation" = "To process a payment using the services provided by GlobalCollect, the following information must be provided by a merchant.\n\nAfter providing the information requested below, this example app can process a payment.";

"ClientSessionIdentifier" = "Client session identifier";

"CustomerIdentifier" = "Customer identifier";

"Region" = "Region";

"Environment" = "Environment";

"AmountInCents" = "Amount in cents";

"CountryCode" = "Country code";

"CurrencyCode" = "Currency code";

"RecurringPayment" = "Payment is recurring";
